#include<bits/stdc++.h>

using namespace std;

string chara[600] = {"あ","い","う","え","お","か","き","く","け","こ","さ","し","す","せ","そ","た","ち","つ","て","と","な","に","ぬ","ね","の","は","ひ","ふ","へ","ほ","ま","み","む","め","も","や","ゆ","よ","ら","り","る","れ","ろ","わ","を","ん","ア","イ","ウ","エ","オ","カ","キ","ク","ケ","コ","サ","シ","ス","セ","ソ","タ","チ","ツ","テ","ト","ナ","ニ","ヌ","ネ","ノ","ハ","ヒ","フ","ヘ","ホ","マ","ミ","ム","メ","モ","ヤ","ユ","ヨ","ラ","リ","ル","レ","ロ","ワ","ヲ","ン"};
int main () {
	int a[5];
	char q='1';
	while(q!='q'){
		cin >> q;
		srand(time(0));
		for (int i=0; i<5 ;i++) {
			a[i] = rand()%50;
		}
		for (int i=0; i<5 ;i++) {
			cout << chara[a[i]] << " | ";
		}
		cout << endl;
	}
}
